/**今日作业(必做)
------------------------------------------------------------------
第一题:分析以下需求,并用代码实现
	向集合中添加四个人姓名做为集合的元素:"张三","李四","王五","赵六"
	遍历集合中的元素并输出


第二题:分析以下需求,并用代码实现
	猜数字小游戏:
		1.系统产生一个随机数1~100之间的。
		2.键盘录入我们要猜的数据
		3.比较这两个数据(用if语句)
			大了：给出提示大了
			小了：给出提示小了
			猜中了：给出提示，恭喜你，猜中了
		4.一直猜,直到猜对为止

第三题：分析以下需求，并用代码实现
	要求:完成代码(按照标准格式写)，然后在测试类中测试。
		1.手机类Phone
		  属性:品牌brand,价格price
		  无参构造,有参构造
		  行为:打电话call,发短信sendMessage,玩游戏,playGame
		2.测试类
		  创建Phone类对象,调用Phone类中的方法

		  思考:假设所有的手机都有属性屏幕的尺寸(int size),而且假设所有手机的屏幕尺寸为6,应该如何实现?


第四题：分析以下需求，并用代码实现
	要求:完成代码(按照标准格式写)，然后在测试类中测试。
		1.项目经理类
			属性：姓名 工号 工资 奖金
			行为：工作work
		2.程序员类
			属性：姓名 工号 工资
			行为：工作work
		3.测试类
			分别创建经理类对象和程序员对象,利用对象调用各自的方法


第五题：分析以下需求，并用代码实现
	1.定义猫类和狗类：
		属性:
			毛的颜色,腿的个数
		行为:
			吃饭
		猫特有行为:
			抓老鼠catchMouse
		狗特有行为:
			看家lookHome
	2.定义测试类:
		分别创建猫类对象和狗类对象,利用对象调用各自的方法

第六题:分析以下需求,并用代码实现
	定义一个工具类(ShapeTool)
		1.需求一:
			在工具类中定义一个方法(getLength)
				形参:长方形的长和宽
				功能:返回长方形的周长
			在工具类中定义一个方法(getSize)
				形参:长方形的长和宽
				功能:返回长方形的面积

		2.需求二:
			在工具类中定义一个方法(getLength)
				形参:圆的半径
				功能:返回圆的周长
			在工具类中定义一个方法(getSize)
				形参:圆的半径
				功能:返回圆的面积
		3.需求三:
			定义一个长方形类,在长方形的类中定义两个长和宽成员
			在长方形类中定义一个方法(getLength)
				形参:无
				功能:求长方形的周长
			在长方形类中定义一个方法(getSize)
				形参:无
				功能:求长方形的面积
		4.需求四:
			定义一个圆形类,在长方形的类中定义半径
			在圆形类中定义一个方法(getLength)
				形参:无
				功能:求圆的周长
			在圆形类中定义一个方法(getSize)
				形参:无
				功能:求圆形形的面积

		5.定义测试类,测试以上四个需求

	思考:两种求长方形周长的实现方式哪种更符合面向对象的设计思想?
	*/